//
// Created by 倔强的猴子 on 2025/12/27.
//

//
// Created by 倔强的猴子 on 2025/12/27.
//
#include<iostream>

 //程序的入口
//int main() {
//    // 计算机中的进制
//    //二进制的表示方式
//    // 0b开头表示这是一个二进制数
//
//    // 八进制
//    // 0 开头表示这是一个八进制的数字
//
//    // 十六进制
//    // 0x 表示这是一个十六进制的数字
//
//    // 十进制
//    // 直接写即可
//
//    //十进制转其他进制
//    // 21 转 二进制 0b 10101
//    /*  21 / 2 = 10 ... 1
//     *  10 / 2 = 5 .... 0
//     *  5 / 2 = 2 .....1
//     *  2 / 2 = 1.....0
//     *  1 / 2 = 0 .... 1
//     * */
//
//    // 其他进制以此类推
//
//    int a = 0b10;
//    std::cout << "a的值为:" << a << std::endl;
//    return 0;
//
//}